//龙虎斗通信协议
/*--------------------------------上行请求--------------------------------------*/
//投注
{
    code : 1113;//int
    data :{
        roomId :0;//房间号 1001  1002 1003，目前就这3个房间
        txId:""; //区块链那边扣款给你的一个回执，Sting
        money:0;//投注金额，float
        opt:1//1 - 7;1龙单2龙双3虎单4虎双5龙6和7虎
    }
}

/*--------------------------------下行请求--------------------------------------*/
//投注
{
    code:1113;
    data:{
        opt :0;
        total:0
        self:0
    }
}
//房间状态变更
{
    code:1114;
    data:{
        state:0;//0禁止游戏 1投注 2等待 3开奖
        time: 0//总时间
    }
}

//房间状态变更
{
    code:1115;
    data:{
        djs: 0;//剩余时间
    }
}

